---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.CannotMatchInstanceSizeToHostError
source: html/0c2d09dd-47d6-ca16-dab7-94dbe0f8106e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.CannotMatchInstanceSizeToHostError Property

The instance of [Symbol] cannot be re-sized to match the host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMatchInstanceSizeToHostError { get; }
```